frontend/controllers/SiteController.php

    public function actionIndex()
    {

        $products = Product::find()->orderBy(['id'=> SORT_DESC])->limit(8);
---
SELECT * FROM `product` ORDER BY `id` DESC LIMIT 8