frontend/controllers/SiteController.php

SELECT * FROM `product` ORDER BY `id` DESC LIMIT 4
---
    public function actionIndex()
    {
        $products = Product::find()->orderBy(['id'=> SORT_DESC])->limit(4);